//
//  LocalNotificationList.swift
//  NonSmokingSupportTimer
//
//  Created by nomura yoshihiro on 2017/11/12.
//  Copyright © 2017年 nomuyoshi. All rights reserved.
//

import Foundation

struct AppConstants {
  static let LocalNotifications = [
    ["interval": 20.0, "body": "血圧が正常化し始め、健康体に近づいています。"],
    ["interval": 7200.0, "body": "血圧が正常化し始め、健康体に近づいています。"],
    ["interval": 28800.0, "body": "血圧が正常化し始め、健康体に近づいています。"],
    ["interval": 86400.0, "body": "血圧が正常化し始め、健康体に近づいています。"],
    ["interval": 172800.0, "body": "血圧が正常化し始め、健康体に近づいています。"],
    ["interval": 259200.0, "body": "血圧が正常化し始め、健康体に近づいています。"],
    ["interval": 604800.0, "body": "血圧が正常化し始め、健康体に近づいています。"],
    ["interval": 1209600.0, "body": "血圧が正常化し始め、健康体に近づいています。"],
    ["interval": 1814400.0, "body": "血圧が正常化し始め、健康体に近づいています。"],
    ["interval": 2592000.0, "body": "血圧が正常化し始め、健康体に近づいています。"],
    ["interval": 5184000.0, "body": "血圧が正常化し始め、健康体に近づいています。"]
  ]
  static let Advice = [
    "60年間毎日1箱吸うとタバコ代は約1,000万円。\nポルシェ買えちゃう・・・",
    "「おっぱい吸いたい！！」そう思って実際に吸いますか？\n吸わないよね！？タバコも同じ。",
    "「タバコを吸うとリラックスできる」ってのは嘘！\nだって吸わなくてもリラックス出来る人はたくさんいますもん。",
    "「吸ったらダメだ」と思うのではなく、「もう吸わなくて良いんだ」って思おう！",
    "禁断症状が辛い？\nタバコを吸わなくても生活できていた頃に戻ろうとしてる証拠。いい傾向！！",
    "タバコに厳しい現代でずっと吸い続けてきたあなたの意志は強い！\n必ず辞めれます！",
    "正直に答えてね。\nタバコって美味しい？？？",
    "温かいお茶飲むと結構落ち着くよ。"
  ]
}
